# This is the conversion map used in restore.py
char_map = {
    'A': 'А', 'a': 'а',
    'B': 'Б', 'b': 'б',
    'C': 'С', 'c': 'с',
    'D': 'Д', 'd': 'д',
    'E': 'Е', 'e': 'е',
    'F': 'Ф', 'f': 'ф',
    'G': 'Г', 'g': 'г',
    'H': 'Ч', 'h': 'ч',
    'I': 'И', 'i': 'и',
    'J': 'Й', 'j': 'й',
    'K': 'К', 'k': 'к',
    'L': 'Л', 'l': 'л',
    'M': 'М', 'm': 'м',
    'N': 'Н', 'n': 'н',
    'O': 'О', 'o': 'о',
    'P': 'П', 'p': 'п',
    'Q': 'Я', 'q': 'я',
    'R': 'Р', 'r': 'р',
    'S': 'С', 's': 'с',
    'T': 'Т', 't': 'т',
    'U': 'У', 'u': 'у',
    'V': 'В', 'v': 'в',
    'W': 'Ш', 'w': 'ш',
    'X': 'Х', 'x': 'х',
    'Y': 'Й', 'y': 'й',
    'Z': 'З', 'z': 'з',
    'â': 'Қ', '¼': 'қ',
    'ô': 'Ҳ', 'Å': 'ҳ',
    'î': 'Ҷ', 'ú': 'ҷ',
    'ë': 'Ғ', '¶': 'ғ',
    '?': 'Э', '[': 'ю',
    '\'': 'ж',  # Note: this is a single quote, not a backslash
    '\\': 'ё', '|': 'Ё',
    '=': 'ъ', '+': 'Ъ',
    '*': '?',  
    ',': ',',
    '#': '/', '@': '!',
}

# Double-character pairs:
pairs_map = {
    'i£': 'ӣ',
    'IÜ': 'Ӣ',
    'u£': 'ӯ',
    'UÜ': 'Ӯ'
    
}